Merge branch 'main' of github.com:Fremal31/Comparison-of-SAT-solvers-in-combinatorics
